id: 65fc5f93-ea4f-4aa2-9044-030060155e3e
name: Risk confirmations in Azure AD Identity Protection [DCSecurityOperations]
description: |
  'Hunt for manual or automatic risk confirmations in Azure AD Identity Protectoin (past 30 days).'
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
tactics:
  - Persistence
relevantTechniques:
  - T1098
query: |

  // Risk confirmations in Azure AD Identity Protection [DCSecurityOperations].
  AuditLogs
  | where OperationName in ("ConfirmAccountCompromised", "ConfirmCompromised", "ConfirmSafe", "ConfirmServicePrincipalCompromised", "confirmServicePrincipalCompromised", "dismissServicePrincipal")
  | project TimeGenerated, OperationName, ResultDescription, InitiatedByUpn=InitiatedBy.user.userPrincipalName, InitiatedById=InitiatedBy.user.id, TargetResources
  | order by TimeGenerated desc
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: AadUserId
        columnName: InitiatedById