id: cf71d178-321f-4f7a-84bf-966d6ac89d3d
name: SSH running as "NT AUTHORITY\System" [DCSecurityOperations]
description: |
  'Hunt for unauthorized usage of SSH in your network. SSH should not run as "NT AUTHORITY\System".'
requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
      - DeviceProcessEvents
tactics:
  - Execution
relevantTechniques:
  - T1059
query: |

  // Suspicious command line events [DCSecurityOperations].
  DeviceProcessEvents
  | where InitiatingProcessCommandLine in ("ssh", "-p 443")
  | where AccountSid == "S-1-5-18"
  | project TimeGenerated, DeviceId, DeviceName, AccountName, InitiatingProcessCommandLine, InitiatingProcessFolderPath, InitiatingProcessFileName
  | order by TimeGenerated desc
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: AzureID
        columnName: DeviceId
      - identifier: HostName
        columnName: DeviceName